Movie Studio

In the last 10 years, which genre was the most profitable at the box office. profits between genres.

Most popular english movies filtered by user rating??? filters - year, english, gross profit, user rating, best director 3 recommendations? comedy vs drama

In [2]:
from scipy import stats

import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

import pandas as pd
import numpy as np

import sqlite3
import zipfile

import warnings
warnings.filterwarnings('ignore')

In [21]:
movie_budget = pd.read_csv("data/tn.movie_budgets.csv.gz", sep= ",")

In [22]:
movie_budget.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [24]:
movie_budget.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

In [178]:
movie_budget_copy = movie_budget.copy()

# Extract the year from the release_date column in the copy
movie_budget_copy['release_year'] = pd.to_datetime(movie_budget_copy['release_date']).dt.year


# Filter dates after 2008 (including 2008) in the copy
filtered_budgets = movie_budget_copy[movie_budget_copy['release_year'] >= 2000]


# Display the first 10 rows of the filtered DataFrame
filtered_budgets

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,release_year
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279",2009
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875",2011
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350",2019
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963",2015
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747",2017
...,...,...,...,...,...,...,...
5776,77,"Dec 31, 2004",The Mongol King,"$7,000",$900,$900,2004
5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0,2018
5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338",2005
5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0,2015
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041",2005

In [162]:
result_sql = pd.merge(filtered_budgets[['release_date', 'movie', 'production_budget', 'domestic_gross', 'worldwide_gross']], movie_basic[['primary_title', 'original_title', 'start_year', 'genres']], left_on='movie', right_on='primary_title', how='inner')

result_sql

,release_date,movie,production_budget,domestic_gross,worldwide_gross,primary_title,original_title,start_year,genres
0,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279",Avatar,Abatâ,2011,Horror
1,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875",Pirates of the Caribbean: On Stranger Tides,Pirates of the Caribbean: On Stranger Tides,2011,"Action,Adventure,Fantasy"
2,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350",Dark Phoenix,Dark Phoenix,2019,"Action,Adventure,Sci-Fi"
3,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963",Avengers: Age of Ultron,Avengers: Age of Ultron,2015,"Action,Adventure,Sci-Fi"
4,"Apr 27, 2018",Avengers: Infinity War,"$300,000,000","$678,815,482","$2,048,134,200",Avengers: Infinity War,Avengers: Infinity War,2018,"Action,Adventure,Sci-Fi"
...,...,...,...,...,...,...,...,...,...
3324,"Jul 6, 2001",Cure,"$10,000","$94,596","$94,596",Cure,Cure,2011,Drama
3325,"Jul 6, 2001",Cure,"$10,000","$94,596","$94,596",Cure,Cure,2014,None
3326,"Jan 13, 2012",Newlyweds,"$9,000","$4,584","$4,584",Newlyweds,Newlyweds,2011,"Comedy,Drama"
3327,"Dec 31, 2018",Red 11,"$7,000",$0,$0,Red 11,Red 11,2019,"Horror,Sci-Fi,Thriller"
3328,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0,A Plague So Pleasant,A Plague So Pleasant,2013,"Drama,Horror,Thriller"

In [163]:
result_sql['worldwide_gross'] = result_sql['worldwide_gross'].str.replace('$', '').str.replace(',', '').astype(float)
result_sql['production_budget'] = result_sql['production_budget'].str.replace('$', '').str.replace(',', '').astype(float)

result_sql['ROI'] = (result_sql['worldwide_gross'] / result_sql['production_budget']) * 100

result_sql

,release_date,movie,production_budget,domestic_gross,worldwide_gross,primary_title,original_title,start_year,genres,ROI
0,"Dec 18, 2009",Avatar,425000000.0,"$760,507,625",2.776345e+09,Avatar,Abatâ,2011,Horror,653.257713
1,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000.0,"$241,063,875",1.045664e+09,Pirates of the Caribbean: On Stranger Tides,Pirates of the Caribbean: On Stranger Tides,2011,"Action,Adventure,Fantasy",254.667286
2,"Jun 7, 2019",Dark Phoenix,350000000.0,"$42,762,350",1.497624e+08,Dark Phoenix,Dark Phoenix,2019,"Action,Adventure,Sci-Fi",42.789243
3,"May 1, 2015",Avengers: Age of Ultron,330600000.0,"$459,005,868",1.403014e+09,Avengers: Age of Ultron,Avengers: Age of Ultron,2015,"Action,Adventure,Sci-Fi",424.384139
4,"Apr 27, 2018",Avengers: Infinity War,300000000.0,"$678,815,482",2.048134e+09,Avengers: Infinity War,Avengers: Infinity War,2018,"Action,Adventure,Sci-Fi",682.711400
...,...,...,...,...,...,...,...,...,...,...
3324,"Jul 6, 2001",Cure,10000.0,"$94,596",9.459600e+04,Cure,Cure,2011,Drama,945.960000
3325,"Jul 6, 2001",Cure,10000.0,"$94,596",9.459600e+04,Cure,Cure,2014,None,945.960000
3326,"Jan 13, 2012",Newlyweds,9000.0,"$4,584",4.584000e+03,Newlyweds,Newlyweds,2011,"Comedy,Drama",50.933333
3327,"Dec 31, 2018",Red 11,7000.0,$0,0.000000e+00,Red 11,Red 11,2019,"Horror,Sci-Fi,Thriller",0.000000
3328,"Sep 29, 2015",A Plague So Pleasant,1400.0,$0,0.000000e+00,A Plague So Pleasant,A Plague So Pleasant,2013,"Drama,Horror,Thriller",0.000000

In [164]:
year = result_sql[result_sql['start_year'] <= 2020]
year

,release_date,movie,production_budget,domestic_gross,worldwide_gross,primary_title,original_title,start_year,genres,ROI
0,"Dec 18, 2009",Avatar,425000000.0,"$760,507,625",2.776345e+09,Avatar,Abatâ,2011,Horror,653.257713
1,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000.0,"$241,063,875",1.045664e+09,Pirates of the Caribbean: On Stranger Tides,Pirates of the Caribbean: On Stranger Tides,2011,"Action,Adventure,Fantasy",254.667286
2,"Jun 7, 2019",Dark Phoenix,350000000.0,"$42,762,350",1.497624e+08,Dark Phoenix,Dark Phoenix,2019,"Action,Adventure,Sci-Fi",42.789243
3,"May 1, 2015",Avengers: Age of Ultron,330600000.0,"$459,005,868",1.403014e+09,Avengers: Age of Ultron,Avengers: Age of Ultron,2015,"Action,Adventure,Sci-Fi",424.384139
4,"Apr 27, 2018",Avengers: Infinity War,300000000.0,"$678,815,482",2.048134e+09,Avengers: Infinity War,Avengers: Infinity War,2018,"Action,Adventure,Sci-Fi",682.711400
...,...,...,...,...,...,...,...,...,...,...
3324,"Jul 6, 2001",Cure,10000.0,"$94,596",9.459600e+04,Cure,Cure,2011,Drama,945.960000
3325,"Jul 6, 2001",Cure,10000.0,"$94,596",9.459600e+04,Cure,Cure,2014,None,945.960000
3326,"Jan 13, 2012",Newlyweds,9000.0,"$4,584",4.584000e+03,Newlyweds,Newlyweds,2011,"Comedy,Drama",50.933333
3327,"Dec 31, 2018",Red 11,7000.0,$0,0.000000e+00,Red 11,Red 11,2019,"Horror,Sci-Fi,Thriller",0.000000
3328,"Sep 29, 2015",A Plague So Pleasant,1400.0,$0,0.000000e+00,A Plague So Pleasant,A Plague So Pleasant,2013,"Drama,Horror,Thriller",0.000000

In [165]:
budget_filter = result_sql[result_sql["production_budget"] <= 80000000.0]
budget_filter

,release_date,movie,production_budget,domestic_gross,worldwide_gross,primary_title,original_title,start_year,genres,ROI
211,"Jun 5, 2009",Home,12000000.0,$0,0.0,Home,Yurt,2011,Drama,0.000000
212,"Jun 5, 2009",Home,12000000.0,$0,0.0,Home,Home,2011,"Documentary,Drama,Family",0.000000
213,"Jun 5, 2009",Home,12000000.0,$0,0.0,Home,Dom,2011,Drama,0.000000
214,"Jun 5, 2009",Home,12000000.0,$0,0.0,Home,Home,2015,"Adventure,Animation,Comedy",0.000000
215,"Jun 5, 2009",Home,12000000.0,$0,0.0,Home,Hemma,2013,"Drama,Romance",0.000000
...,...,...,...,...,...,...,...,...,...,...
3324,"Jul 6, 2001",Cure,10000.0,"$94,596",94596.0,Cure,Cure,2011,Drama,945.960000
3325,"Jul 6, 2001",Cure,10000.0,"$94,596",94596.0,Cure,Cure,2014,None,945.960000
3326,"Jan 13, 2012",Newlyweds,9000.0,"$4,584",4584.0,Newlyweds,Newlyweds,2011,"Comedy,Drama",50.933333
3327,"Dec 31, 2018",Red 11,7000.0,$0,0.0,Red 11,Red 11,2019,"Horror,Sci-Fi,Thriller",0.000000
3328,"Sep 29, 2015",A Plague So Pleasant,1400.0,$0,0.0,A Plague So Pleasant,A Plague So Pleasant,2013,"Drama,Horror,Thriller",0.000000

In [166]:
profit = budget_filter[budget_filter["ROI"] >= 200.0]
profit.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1083 entries, 235 to 3325
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   release_date       1083 non-null   object
 1   movie              1083 non-null   object
 2   production_budget  1083 non-null   float64
 3   domestic_gross     1083 non-null   object
 4   worldwide_gross    1083 non-null   float64
 5   primary_title      1083 non-null   object
 6   original_title     1083 non-null   object
 7   start_year         1083 non-null   int64
 8   genres             1064 non-null   object
 9   ROI                1083 non-null   float64
dtypes: float64(3), int64(1), object(6)
memory usage: 93.1+ KB

In [167]:
profit

,release_date,movie,production_budget,domestic_gross,worldwide_gross,primary_title,original_title,start_year,genres,ROI
235,"Apr 23, 2009",Home,500000.0,"$15,433",44793168.0,Home,Yurt,2011,Drama,8958.6336
236,"Apr 23, 2009",Home,500000.0,"$15,433",44793168.0,Home,Home,2011,"Documentary,Drama,Family",8958.6336
237,"Apr 23, 2009",Home,500000.0,"$15,433",44793168.0,Home,Dom,2011,Drama,8958.6336
238,"Apr 23, 2009",Home,500000.0,"$15,433",44793168.0,Home,Home,2015,"Adventure,Animation,Comedy",8958.6336
239,"Apr 23, 2009",Home,500000.0,"$15,433",44793168.0,Home,Hemma,2013,"Drama,Romance",8958.6336
...,...,...,...,...,...,...,...,...,...,...
3312,"Sep 1, 2015",Exeter,25000.0,$0,489792.0,Exeter,Exeter,2014,Horror,1959.1680
3313,"Sep 1, 2015",Exeter,25000.0,$0,489792.0,Exeter,Exeter,2015,None,1959.1680
3323,"Apr 28, 2006",Clean,10000.0,"$138,711",138711.0,Clean,Clean,2017,"Comedy,Drama,Horror",1387.1100
3324,"Jul 6, 2001",Cure,10000.0,"$94,596",94596.0,Cure,Cure,2011,Drama,945.9600
3325,"Jul 6, 2001",Cure,10000.0,"$94,596",94596.0,Cure,Cure,2014,None,945.9600

In [170]:
profit.drop_duplicates(subset="movie", keep="first", inplace=True)

In [171]:
profit

,release_date,movie,production_budget,domestic_gross,worldwide_gross,primary_title,original_title,start_year,genres,ROI
235,"Apr 23, 2009",Home,500000.0,"$15,433",44793168.0,Home,Yurt,2011,Drama,8958.633600
444,"Mar 23, 2012",The Hunger Games,80000000.0,"$408,010,692",677923379.0,The Hunger Games,The Hunger Games,2012,"Action,Adventure,Sci-Fi",847.404224
445,"May 26, 2011",The Hangover Part II,80000000.0,"$254,464,305",586464305.0,The Hangover Part II,The Hangover Part II,2011,"Comedy,Mystery",733.080381
446,"Feb 10, 2017",The Lego Batman Movie,80000000.0,"$175,750,384",310660018.0,The Lego Batman Movie,The Lego Batman Movie,2017,"Action,Animation,Comedy",388.325022
447,"Sep 25, 2015",Hotel Transylvania 2,80000000.0,"$169,700,110",469500298.0,Hotel Transylvania 2,Hotel Transylvania 2,2015,"Animation,Comedy,Family",586.875373
...,...,...,...,...,...,...,...,...,...,...
3305,"Mar 18, 2016",Krisha,30000.0,"$144,822",144822.0,Krisha,Krisha,2015,Drama,482.740000
3310,"Jan 14, 2000",The Terrorist,25000.0,"$195,043",195043.0,The Terrorist,The Terrorist,2018,Thriller,780.172000
3311,"Sep 1, 2015",Exeter,25000.0,$0,489792.0,Exeter,Exeter,2015,"Horror,Mystery,Thriller",1959.168000
3323,"Apr 28, 2006",Clean,10000.0,"$138,711",138711.0,Clean,Clean,2017,"Comedy,Drama,Horror",1387.110000
3324,"Jul 6, 2001",Cure,10000.0,"$94,596",94596.0,Cure,Cure,2011,Drama,945.960000

In [172]:
profit["movie"].value_counts()

The Grey                1
Where the Heart Is      1
Safe Haven              1
Scream 4                1
Yogi Bear               1
                       ..
Closer                  1
The Illusionist         1
The Butterfly Effect    1
Ida                     1
Bridesmaids             1
Name: movie, Length: 731, dtype: int64

In [86]:
result_sql.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2490 entries, 0 to 2489
Data columns (total 20 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   original_language  2490 non-null   object
 1   original_title     2490 non-null   object
 2   release_date_x     2490 non-null   object
 3   title              2490 non-null   object
 4   vote_average       2490 non-null   float64
 5   id                 2490 non-null   int64
 6   release_date_y     2490 non-null   object
 7   movie              2490 non-null   object
 8   production_budget  2490 non-null   float64
 9   domestic_gross     2490 non-null   object
 10  worldwide_gross    2490 non-null   float64
 11  release_year       2490 non-null   int64
 12  movie_id           2490 non-null   object
 13  averagerating      2490 non-null   float64
 14  numvotes           2490 non-null   int64
 15  primary_title      2490 non-null   object
 16  start_year         2490 non-null   int64
 17  runtime_minutes    2429 non-null   float64
 18  genres             2483 non-null   object
 19  ROI                2490 non-null   float64
dtypes: float64(6), int64(4), object(10)
memory usage: 408.5+ KB

In [174]:
profit['release_month'] = profit['release_date'].dt.month

AttributeError: Can only use .dt accessor with datetimelike values

In [70]:
result_sql["original_title"].value_counts()

Eden                42
The Gift            32
Home                30
Split               24
Truth or Dare       20
                    ..
Desert Dancer        1
Small Apartments     1
Red Sparrow          1
Bone Tomahawk        1
Mortal Engines       1
Name: original_title, Length: 1041, dtype: int64

In [72]:
result_sql.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1721 entries, 0 to 1720
Data columns (total 20 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   original_language  1721 non-null   object
 1   original_title     1721 non-null   object
 2   release_date_x     1721 non-null   object
 3   title              1721 non-null   object
 4   vote_average       1721 non-null   float64
 5   id                 1721 non-null   int64
 6   release_date_y     1721 non-null   object
 7   movie              1721 non-null   object
 8   production_budget  1721 non-null   float64
 9   domestic_gross     1721 non-null   object
 10  worldwide_gross    1721 non-null   float64
 11  release_year       1721 non-null   int64
 12  movie_id           1721 non-null   object
 13  averagerating      1721 non-null   float64
 14  numvotes           1721 non-null   int64
 15  primary_title      1721 non-null   object
 16  start_year         1721 non-null   int64
 17  runtime_minutes    1674 non-null   float64
 18  genres             1717 non-null   object
 19  ROI                1721 non-null   float64
dtypes: float64(6), int64(4), object(10)
memory usage: 282.4+ KB

In [43]:
conn = sqlite3.connect('im.db.zip')
#specify the path to the zip file
zip_file_path = 'data/im.db.zip'

#Extract the SQLite database file from the zip file
with zipfile.ZipFile(zip_file_path, 'r') as zip_ref:
    zip_ref.extractall('unzippedData')

#connect to extracted SQLite database
database_path = 'unzippedData/im.db'
conn = sqlite3.connect(database_path)

In [44]:
schema_df = pd.read_sql("""

SELECT *
FROM sqlite_master

""", conn)

schema_df

,type,name,tbl_name,rootpage,sql
0,table,movie_basics,movie_basics,2,"CREATE TABLE ""movie_basics"" (\n""movie_id"" TEXT..."
1,table,directors,directors,3,"CREATE TABLE ""directors"" (\n""movie_id"" TEXT,\n..."
2,table,known_for,known_for,4,"CREATE TABLE ""known_for"" (\n""person_id"" TEXT,\..."
3,table,movie_akas,movie_akas,5,"CREATE TABLE ""movie_akas"" (\n""movie_id"" TEXT,\..."
4,table,movie_ratings,movie_ratings,6,"CREATE TABLE ""movie_ratings"" (\n""movie_id"" TEX..."
5,table,persons,persons,7,"CREATE TABLE ""persons"" (\n""person_id"" TEXT,\n ..."
6,table,principals,principals,8,"CREATE TABLE ""principals"" (\n""movie_id"" TEXT,\..."
7,table,writers,writers,9,"CREATE TABLE ""writers"" (\n""movie_id"" TEXT,\n ..."

In [90]:
movie_basic = pd.read_sql('''
    SELECT *
    FROM movie_basics
''', conn)
movie_basic.head()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [137]:
movie_basic["start_year"].value_counts()

2017    17504
2016    17272
2018    16849
2015    16243
2014    15589
2013    14709
2012    13787
2011    12900
2010    11849
2019     8379
2020      937
2021       83
2022       32
2023        5
2024        2
2027        1
2026        1
2025        1
2115        1
Name: start_year, dtype: int64